CODEXES = {

    # Цивільний кодекс

    "цку": {
        "name": "Цивільний кодекс України",
        "number": "435-IV"
    },

    "цивільний кодекс": {
        "name": "Цивільний кодекс України",
        "number": "435-IV"
    },

    "цивільного кодексу": {
        "name": "Цивільний кодекс України",
        "number": "435-IV"
    },

    # ЦПК

    "цпк": {
        "name": "Цивільний процесуальний кодекс України",
        "number": "1618-IV"
    },

    "цивільний процесуальний кодекс": {
        "name": "Цивільний процесуальний кодекс України",
        "number": "1618-IV"
    },

    # Кримінальний

    "кку": {
        "name": "Кримінальний кодекс України",
        "number": "2341-III"
    },

    "кримінальний кодекс": {
        "name": "Кримінальний кодекс України",
        "number": "2341-III"
    },

    # КПК

    "кпк": {
        "name": "Кримінальний процесуальний кодекс України",
        "number": "4651-VI"
    },

    # КУпАП

    "купап": {
        "name": "Кодекс України про адміністративні правопорушення",
        "number": "80731-X"
    },

    # КАС

    "кас": {
        "name": "Кодекс адміністративного судочинства України",
        "number": "2747-IV"
    },

    # ГПК

    "гпк": {
        "name": "Господарський процесуальний кодекс України",
        "number": "1798-XII"
    },

    # ГК

    "гку": {
        "name": "Господарський кодекс України",
        "number": "436-IV"
    }

}