CODEXES = {

    # -------------------------------
    # Цивільний кодекс
    # -------------------------------

    "цку": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    "цивільний кодекс": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    "цивільного кодексу": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    # -------------------------------
    # ЦПК
    # -------------------------------

    "цпк": {
        "name": "Цивільний процесуальний кодекс України",
        "law_id": "1618-15"
    },

    "цивільний процесуальний кодекс": {
        "name": "Цивільний процесуальний кодекс України",
        "law_id": "1618-15"
    },

    # -------------------------------
    # Кримінальний кодекс
    # -------------------------------

    "кку": {
        "name": "Кримінальний кодекс України",
        "law_id": "2341-14"
    },

    "кримінальний кодекс": {
        "name": "Кримінальний кодекс України",
        "law_id": "2341-14"
    },

    # -------------------------------
    # КПК
    # -------------------------------

    "кпк": {
        "name": "Кримінальний процесуальний кодекс України",
        "law_id": "4651-17"
    },

    "кримінальний процесуальний кодекс": {
        "name": "Кримінальний процесуальний кодекс України",
        "law_id": "4651-17"
    },

    # -------------------------------
    # КУпАП
    # -------------------------------

    "купап": {
        "name": "Кодекс України про адміністративні правопорушення",
        "law_id": "80731-10"
    },

    "кодекс україни про адміністративні правопорушення": {
        "name": "Кодекс України про адміністративні правопорушення",
        "law_id": "80731-10"
    },
    
    "КУпАП": {
        "name": "Кодекс України про адміністративні правопорушення",
        "law_id": "80731-10"
    },

    # -------------------------------
    # КАС України
    # -------------------------------

    "кас": {
        "name": "Кодекс адміністративного судочинства України",
        "law_id": "2747-15"
    },

    "касу": {
        "name": "Кодекс адміністративного судочинства України",
        "law_id": "2747-15"
    },

    "кодекс адміністративного судочинства": {
        "name": "Кодекс адміністративного судочинства України",
        "law_id": "2747-15"
    },

    # -------------------------------
    # ГПК
    # -------------------------------

    "гпк": {
        "name": "Господарський процесуальний кодекс України",
        "law_id": "1798-12"
    },

    "господарський процесуальний кодекс": {
        "name": "Господарський процесуальний кодекс України",
        "law_id": "1798-12"
    },


    # -------------------------------
    # КЗпП
    # -------------------------------

    "кзпп": {
        "name": "Кодекс законів про працю України",
        "law_id": "322-08"
    },

    "кодекс законів про працю": {
        "name": "Кодекс законів про працю України",
        "law_id": "322-08"
    },

    "Кодекс законів про працю": {
        "name": "Кодекс законів про працю України",
        "law_id": "322-08"
    },
    "КЗпП": {
        "name": "Кодекс законів про працю України",
        "law_id": "322-08"
    },

    # -------------------------------
    # Сімейний кодекс
    # -------------------------------

    "ску": {
        "name": "Сімейний кодекс України",
        "law_id": "2947-14"
    },

    "сімейний кодекс": {
        "name": "Сімейний кодекс України",
        "law_id": "2947-14"
    },

    # -------------------------------
    # Податковий кодекс
    # -------------------------------

    "пку": {
        "name": "Податковий кодекс України",
        "law_id": "2755-17"
    },

    "податковий кодекс": {
        "name": "Податковий кодекс України",
        "law_id": "2755-17"
    },

    # -------------------------------
    # Митний кодекс
    # -------------------------------

    "мку": {
        "name": "Митний кодекс України",
        "law_id": "4495-17"
    },

    "митний кодекс": {
        "name": "Митний кодекс України",
        "law_id": "4495-17"
    },

    # -------------------------------
    # Бюджетний кодекс
    # -------------------------------

    "бку": {
        "name": "Бюджетний кодекс України",
        "law_id": "2456-17"
    },

    "бюджетний кодекс": {
        "name": "Бюджетний кодекс України",
        "law_id": "2456-17"
    },

    # -------------------------------
    # Кодекс України з процедур банкрутства
    # -------------------------------

    "кузпб": {
        "name": "Кодекс України з процедур банкрутства",
        "law_id": "2597-19"
    },

    "кодекс україни з процедур банкрутства": {
        "name": "Кодекс України з процедур банкрутства",
        "law_id": "2597-19"
    }

}