CODEXES = {

    # -------------------------------
    # Цивільний кодекс
    # -------------------------------

    "цку": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    "цивільний кодекс": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    "цивільного кодексу": {
        "name": "Цивільний кодекс України",
        "law_id": "435-15"
    },

    # -------------------------------
    # ЦПК
    # -------------------------------

    "цпк": {
        "name": "Цивільний процесуальний кодекс України",
        "law_id": "1618-15"
    },

    "цивільний процесуальний кодекс": {
        "name": "Цивільний процесуальний кодекс України",
        "law_id": "1618-15"
    },

    # -------------------------------
    # Кримінальний кодекс
    # -------------------------------

    "кку": {
        "name": "Кримінальний кодекс України",
        "law_id": "2341-14"
    },

    "кримінальний кодекс": {
        "name": "Кримінальний кодекс України",
        "law_id": "2341-14"
    },

    # -------------------------------
    # КПК
    # -------------------------------

    "кпк": {
        "name": "Кримінальний процесуальний кодекс України",
        "law_id": "4651-17"
    },

    # -------------------------------
    # КУпАП
    # -------------------------------

    "купап": {
        "name": "Кодекс України про адміністративні правопорушення",
        "law_id": "80731-10"
    },

    # -------------------------------
    # КАС
    # -------------------------------

    "кас": {
        "name": "Кодекс адміністративного судочинства України",
        "law_id": "2747-15"
    },

    # -------------------------------
    # ГПК
    # -------------------------------

    "гпк": {
        "name": "Господарський процесуальний кодекс України",
        "law_id": "1798-12"
    },


}